README.org
# -*- org -*-
#+TITLE:     CL-OpenID
#+AUTHOR:    Maciej Pasternacki
#+EMAIL:     maciej@pasternacki.net
#+LANGUAGE:  en
#+OPTIONS:   H:5 num:t toc:t \n:nil @:t ::t |:t ^:nil f:t *:t TeX:t LaTeX:t skip:nil d:nil tags:not-in-toc

Cl-OpenID is an implementation of [[http://openid.net/][OpenID]] protocol in Common Lisp.  It
implements [[http://openid.net/specs/openid-authentication-2_0.html][OpenID Authentication 2.0]] standard and is compatible with
[[http://openid.net/specs/openid-authentication-1_1.html][OpenID Authentication 1.1]].  Both Relying Party (formerly called OpenID
Consumer), and OpenID Provider are implemented.

CL-OpenID is available on terms of [[http://opensource.franz.com/license.html][GNU Lesser General Public License
version 2.1]] with Franz Inc.'s [[http://opensource.franz.com/preamble.html][preamble]], also known as LLGPL (Lisp
Lesser General Public License).

The project is developed as a [[http://code.google.com/soc/2008][Google Summer of Code 2008]] project,
developed by Maciej Pasternacki and mentored by Anton Vodonosov.
Original application is published at
[[http://trac.common-lisp.net/cl-openid/wiki/OriginalProposal]].

* Contact
  Discussions regarding development are conducted on [[http://common-lisp.net/cgi-bin/mailman/listinfo/cl-openid-devel][cl-openid-devel]]
  mailing list.  This is the best place to bring up questions,
  suggestions or to discuss issues connected with CL-OpenID.

  Important announcements are posted to [[http://common-lisp.net/cgi-bin/mailman/listinfo/cl-openid-announce][cl-openid-announce]] mailing
  list.  This is a low-volume, announcement-only list.  All the
  announcements are also posted on development list.

  Bugs are tracked on [[http://trac.common-lisp.net/cl-openid/report/1][project's Trac bugtracker]].  Interface for
  submitting new tickets is available at
  [[http://trac.common-lisp.net/cl-openid/newticket]].  All ticket change
  notifications are sent to [[http://common-lisp.net/cgi-bin/mailman/listinfo/cl-openid-ticket][cl-openid-ticket]] mailing list.

  Miscellaneous information on project, of various quality and
  relevance, can be found on project's [[http://trac.common-lisp.net/cl-openid/][Trac wiki]].

* Downloading
  Project Web page is [[http://common-lisp.net/project/cl-openid/]].  Most
  recent version of the code can be downloaded with [[http://www.darcs.net][darcs]]:

  : darcs get http://common-lisp.net/project/cl-openid/

** Dependencies
   Project depends on following libraries:
   - [[http://weitz.de/drakma/][drakma]],
   - [[http://www.method-combination.net/lisp/ironclad/][ironclad]],
   - [[http://common-lisp.net/project/xmls/][xmls]],
   - [[http://cliki.net/split-sequence][split-sequence]],
   - [[http://www.cliki.net/cl-base64][cl-base64]],
   - [[http://common-lisp.net/project/trivial-utf-8/darcs/trivial-utf-8][trivial-utf-8]],
   - [[http://common-lisp.net/project/bordeaux-threads/][bordeaux-threads]]
   - [[http://puri.b9.com/][puri]],
   - [[https://github.com/avodonosov/secure-random/][secure-random]]
   - [[http://www.cliki.net/CL-HTML-Parse][cl-html-parse]] (on implementations other than Allegro CL).

   Example code depends also on [[http://weitz.de/hunchentoot/][Hunchentoot]].  Unit tests depend on
   [[http://common-lisp.net/project/bese/FiveAM.html][FiveAM]] testing framework.

   All required libraries should be ASDF-installable, so running =darcs
   dist= and then calling =ASDF-INSTALL:INSTALL= on resulting tarball
   should provide complete dependencies.

*** CL-Librarian shelf
    As an alternative to ASDF-Install, a [[http://www.pasternacki.net/en/code/cl-librarian/][CL-Librarian]] shelf definition
    for dependencies is provided.  To use it, run following shell
    commands in CL-OpenID directory:
    : darcs get http://www.pasternacki.net/repos/cl-librarian/ lib
    : cd lib
    : sh bootstrap.sh
    : cd ..
    Then start your favourite Lisp implementation and call:
    : (load "shelf")
    : (cl-librarian:download-shelf 'cl-openid.deps) ; for the first time or when new dependency is added
    : (cl-librarian:use-shelf 'cl-openid.deps) ; when libraries are already downloaded
    : (asdf:oos 'asdf:load-op :cl-openid)
    : (asdf:oos 'asdf:test-op :cl-openid) ; run 5am unit tests

** Example code
   Example implementation of Relying Party and OpenID Provider for
   [[http://weitz.de/hunchentoot/][Hunchentoot]] web server is included in =examples/= subdirectory.  For
   convenience, both examples can be loaded as =CL-OPENID.EXAMPLES=
   ASDF system:
   : (asdf:oos 'asdf:load-op :cl-openid.examples)

* Provided API

** Relying Party

*** Class =RELYING-PARTY=
    Relying Party class.

**** Accessor =ROOT-URI= /relying-party/ ⇒ /uri/
     Root URI address of the Relying Party instance.

     Used to generate return_to redirections.

**** Accessor =REALM= /relying-party/ ⇒ /uri/
     Relying Party realm.

*** Constant =+AUTHPROC-HANDLE-PARAMETER+=
    Name of HTTP GET parameter, sent in return_to URI, which contains
    AUTH-PROCESS object unique handle.

*** Function =INITIATE-AUTHENTICATION= /relying-party given-id &key immediate-p extra-parameters/ ⇒ /uri/
    Initiate authentication process by /relying-party/ for identifier
    /given-id/ received from user.

    If /immediate-p/ is true, initiates immediate authentication
    process.  

    The /extra-parameters/ is an optional key-value list to be added to the authentication request message. 
    The list format is the same as for the =MAKE-MESSAGE= function. This parameter is needed for OpenID 
    extensions, for example OAuth or Attribute Exchange.

    Returns multiple values:
      - the URI to redirect the user's browser to;
      - Unique handle (string) identifying the started authentication process;
      - the AUTH-PROCESS structure identified by the handle.

     The latter two values are useful if the client code needs to track the process.

*** Function =HANDLE-INDIRECT-RESPONSE= /relying-party message request-uri &optional auth-process/ ⇒ /authendicated-id auth-process/
    Handle indirect response /message/ for /relying-party/, coming at /request-uri/, concerning /authproc/.

    /authproc/ can be a literal AUTH-PROCESS object, or a string
    (unique authproc handle, sent earlier by Relying Party). When
    /authproc/ is NIL or not supplied, its handle is taken from
    /message/ field named =+AUTHPROC-HANDLE-PARAMETER+=.

    Returns claimed ID URI on success, NIL on failure.  As second
    value, always returns AUTH-PROCESS object.

*** Condition =OPENID-ASSERTION-ERROR=
    Error signaled by Relying Party when indirect response cannot be
    verified correctly.

