README.org
**** Accessor =CODE= /openid-assertion-error/ ⇒ /keyword/
     Keyword code of error.

     Possible values are
     - =:SERVER-ERROR= (received response is an erroor message),
     - =:SETUP-NEEDED= (negative response to immediate request),
     - =:INVALID-RETURN-TO= (request doesn't match previously sent openid.return_to),
     - =:INVALID-NAMESPACE= (invalid openid.ns in received message),
     - =:INVALID-ENDPOINT= (endpoint specified in assertion does not match previously discovered information),
     - =:INVALID-CLAIMED-ID= (received claimed_id differs from specified previously, discovery for received claimed ID returns other endpoint),
     - =:INVALID-NONCE= (repeated openid.nonce),
     - =:INVALID-SIGNATURE= (signature verification failed),
     - =:INVALID-SIGNED-FIELDS= (not all fields that need to be signed, were signed).

**** Accessor =REASON= /openid-assertion-error/ ⇒ /string/
     Textual description of error.

**** Accessor =AUTHPROC= /openid-assertion-error/ ⇒ /auth-process/
     The =AUTH-PROCESS= structure that was being verified.

**** Accessor =MESSAGE= /openid-assertion-error/ ⇒ /message/
     Received message (an association list).

*** Structure =AUTH-PROCESS=
    Data structure gathering information about an ongoing
    authentication process.

**** Function =AUTH-PROCESS-P= /object/ ⇒ /boolean/
     Returns true if /object/ is an =AUTH-PROCESS= structure.

**** Accessor =PROTOCOL-VERSION-MAJOR= /auth-process/ ⇒ /integer/
     Protocol version major number of /auth-process/.

**** Accessor =PROTOCOL-VERSION-MINOR= /auth-process/ ⇒ /integer/
     Protocol version minor number of /auth-process/.

**** Accessor =PROTOCOL-VERSION= /auth-process/ ⇒ /cons/
     Protocol version of an authentication process, as a cons =(MAJOR . MINOR)=.

**** Accessor =CLAIMED-ID= /auth-process/ ⇒ /uri/
     Claimed ID of an auth proces.

**** Accessor =OP-LOCAL-ID= /auth-process/ ⇒ /uri/
     OP-local id of an auth process.

**** Accessor =PROVIDER-ENDPOINT-URI= /auth-process/ ⇒ /uri/
     Discovered endpoint URI.

**** Accessor =RETURN-TO= /auth-process/ ⇒ /uri/
     Authentication process' return_to address.

     It is Relying Party's root URI with added HTTP GET parameter
     named =+AUTHPROC-HANDLE-PARAMETER+= whose value is authproc's
     unique handle.

**** Accessor =TIMESTAMP= /auth-process/ ⇒ /universal-time/
     Universal time of authentication process structure's creation.

**** Accessor =XRDS-LOCATION= /auth-process/ ⇒ /uri/
     Address of XRDS file used in /auth-process/ discovery.

** OpenID Provider
*** Class =OPENID-PROVIDER=
    OpenID Provider server abstract class.

    This class should be subclassed, and specialized methods should be
    provided at least for =HANDLE-CHECKID-SETUP= (preferably also for
    =HANDLE-CHECKID-IMMEDIATE=).

**** Accessor =ENDPOINT-URI= /op/ ⇒ /uri/
     OpenID Provider instance's endpoint URI

*** Constant =+INDIRECT-RESPONSE-CODE+=
    HTTP code used for indirect response redirections.

*** Function =HANDLE-OPENID-PROVIDER-REQUEST= /op message &key secure-p/ ⇒ /response values/
    Handle request /message/ for OpenID Provider instance /op/.

    /secure-p/ should be passed by caller to indicate whether it is
    secure to use unencrypted association method.

    Returns two values: first is body, and second is HTTP code.  If
    second value is not returned, 200 OK HTTP code should be assumed.

    On HTTP redirections (second value between 300 and 399 inclusive,
    actually it will be =+INDIRECT-RESPONSE-CODE+=), primary returned
    value will be an URI to redirect user to.

    The same rules apply to all =*-RESPONSE= functions and
    =WITH-INDIRECT-ERROR-HANDLER= form return values.

*** Function =CANCEL-RESPONSE= /op/ /message/ ⇒ /response values/
    Send cancel (authenticaction failure) response to MESSAGE from OP.

*** Function =SUCCESSFUL-RESPONSE= /op/ /message/ ⇒ /response values/
    Return successful response to /message/ by /op/.

*** Macro =WITH-INDIRECT-ERROR-HANDLER= /&body body/ ⇒ /response values/
    Handle =INDIRECT-ERROR= in /body/.

    When =INDIRECT-ERROR= condition is signaled, immediately return
    indirect error response.

*** Function =SIGNAL-INDIRECT-ERROR= /message reason &rest reason-args/
    Signal =INDIRECT-ERROR= condition as reply to /message/,
    effectively returning indirect error reply from
    =WITH-INDIRECT-ERROR-HANDLER= block.

    /Reason/ is textual error message format string, with
    /reason-args/ being its arguments.


*** Generic =HANDLE-CHECKID-IMMEDIATE= /op message/ ⇒ /generalized-boolean/
    Handle checkid_immediate requests.

    This generic should be specialized on concrete Provider classes to
    perform immediate login checks on /MESSAGE/.  It should return at
    once, either true value (to indicate successful login), or NIL (to
    indicate immediate login failure).

    Default method always fails.

    This generic is called within scope of
    =WITH-INDIRECT-ERROR-HANDLER=.

*** Generic =USER-SETUP-URL= /op message/ ⇒ /uri/
    URI for user setup to return on failed immediate request.

    When NIL is returned, no user_setup_url is sent in setup_needed
    responses.

    This generic should be specialized on concrete Provider classes to
    provide entry point to user authentication dialogue.

    Default method always returns NIL.

*** Generic =HANDLE-CHECKID-SETUP= /op message/ ⇒ /response values/
    Handle checkid_setup requests.

    This generic should be specialized on concrete Provider classes to
    perform login checks with user dialogue, that would (possibly
    after some HTTP request-response cycles) end in either
    =SUCCESSFUL-RESPONSE=, or in =CANCEL-RESPONSE=.

    Default method always fails.

    This generic is called within scope of
    =WITH-INDIRECT-ERROR-HANDLER=.


*** Protocol messages
    Messages passed between OpenID Provider and the Relying Party are
    composed of key-value pairs.  Natural Lisp representation of
    those, and the one used in CL-OpenID, is an association list.  A
    handful of conveniense function is provided to avoid tweaking
    messages on cons level.

**** Function =MAKE-MESSAGE= /&rest parameters/ ⇒ /message/
     Make new message from arbitrary keyword parameters.

     Keyword specifies a message field key (actual key is lowercased
     symbol name), and value following the keyword specifies
     associated value.

     Value can be a string (which will be literal field value), symbol
     (symbol's name will be used as a value), vector of
     (UNSIGNED-BYTE 8) (which will be Base64-encoded), URI object or
     integer (which both will be PRINC-TO-STRING-ed).

     If value is NIL, field won't be included in the message at all.

