README.org
**** Function =COPY-MESSAGE= /message &rest parameters/ ⇒ /message/
     Create a copy of MESSAGE, updating PARAMETERS provided as keyword parameters.

     If MESSAGE already includes provided key, new value is used in
     the result; if a key is new, the field will be appended to result
     message.  PARAMETERS are interpreted as by MAKE-MESSAGE function.

**** Function =IN-NS= /message &optional namespace/ ⇒ /message/
     Add openid.namespace /namespace/ to /message/.

     Default namespace is OpenID v2.  Returns updated message alist.

**** Function =MESSAGE-FIELD= /message field-name/ ⇒ /value/
     Get value of /field-name/ field from /message/.

**** Function =MESSAGE-V2-P= /message/ ⇒ /boolean/
     True if /message/ is an OpenID v2 message (namespace check).

     
